 #include<stdio.h>
 #include<conio.h>
 #include <locale.h>
 void main()
 {
 char *locale = setlocale(LC_ALL, "");
 int i,a,b;
 /* —————————————————— */
 printf("\nВведите два целых числа: "); scanf("%d %d",&a,&b);
 printf("\n");
printf("Номера и значения битов старшего байта числа a:\n");
for (i=15;i>=8;i--) /* Объясните используемый интервал */
 printf("(%d,%d) ",i,(a>>i)&0x01); /* Объясните запись (a>>i)&0x01 */
printf("\n\n");
/* —————————————————— */
printf("Номера и значения битов младшего байта числа a:\n");
for (i=7;i>=0;i--) /* Объясните используемый интервал */
 printf("(%d,%d) ",i,(a>>i)&0x01);
printf("\n\n");
/* ————————————– */
printf("Биты числа b в прямом порядке : ");
for (i=15;i>=0;i--)
 printf("%d",(b>>i)&0x01);
printf("\n");
/* ————————————– */
printf("Биты числа b в обратном порядке: "); /* Допишите код, ссылаясь на
пример: «Биты числа b в прямом порядке» */
for (i=0;i<=15;i++)
 printf("%d",(b>>i)&0x01);
printf("\n\n");
/* ———————————————— */
 getch();
}

