#include<stdio.h>
 #include<conio.h>
 void main()
 {
 int y,x,z,k;
 x=03; y=02; z=01;
 k=x|y&z; printf("1. %d\n",k); /* k=(x|(02&01)); (вследствие приоритетов операций) 02&01 -> 102&012 -> 002 k=(x|00); 03|002 -> 112|002 -> 112*/
 k=x|y&~z; printf("2. %d\n",k); /* Сначала инверсия, потом И, затем ИЛИ */
 k=x^y&~z; printf("3. %d\n",k); /* Сначала инверсия, потом И, затем ИЛИ */
 k=x&y&&z; printf("4. %d\n",k); /* Сначала И, затем импликация */
 x=1; y=-1;
 k=!x|x; printf("5. %d\n",k); /* Сначала отрицание, потом ИЛИ */
 k=-x|x; printf("6. %d\n",k); /* Операции 6 */
 k=x^x; printf("7. %d\n",k); /* Исключающее ИЛИ  */
 x<<=3; printf("8. %d\n",x); /* Операции 8 */
 y<<=3; printf("9. %d\n",y); /* Операции 9 */
 y>>=3; printf("10. %d\n\n",y); /* Операции 10 */
 getch();
 }

